docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About Me</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">About Me</h1>
<p>
Hi, I'm semi. I'm a programmer who mostly works in keyboard layout
analysis and creation.
</p>
<div id="outline-container-org50036d9" class="outline-2">
<h2 id="org50036d9">Stuff I have done</h2>
<div class="outline-text-2" id="text-org50036d9">
</div>
<div id="outline-container-org6381acb" class="outline-3">
<h3 id="org6381acb"><a href="semimak/index.html">Semimak</a></h3>
<div class="outline-text-3" id="text-org6381acb">
<p>
Semimak is a keyboard layout designed primarily for high comfort at
high typing speeds. In July 2021, <a href="https://github.com/notgate">NotGate</a> and I held a one month
long tournament to learn it with an $835 prize pool, which over 200
people participated in.
</p>
</div>
</div>
<div id="outline-container-org9c4014a" class="outline-3">
<h3 id="org9c4014a"><a href="./genkey/index.html">genkey</a></h3>
<div class="outline-text-3" id="text-org9c4014a">
<p>
genkey is a tool for keyboard layout analysis and generation that
I created to make Semimak. It's multi-threaded and pretty
powerful; on my laptop, it can analyze some simple stats at a rate
of 1 million layouts per second.
</p>
</div>
</div>
<div id="outline-container-org67c2422" class="outline-3">
<h3 id="org67c2422">klcord</h3>
<div class="outline-text-3" id="text-org67c2422">
<p>
<a href="https://github.com/semilin/klcord">klcord</a> is a basic Discord bot for getting keyboard layout
information, because there are too many of them and we can't keep
track of them or where to find them.
</p>

<p>
Usage: <code>!layout layoutname</code>
</p>
</div>
</div>
<div id="outline-container-orgaa9691d" class="outline-3">
<h3 id="orgaa9691d">More in the future</h3>
<div class="outline-text-3" id="text-orgaa9691d">
<p>
I have a lot of ideas. Sometimes I forget them, or am too bad to
make them. Eventually, some of them will get made, so look forward
to that.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb76364b" class="outline-2">
<h2 id="orgb76364b">Stuff I use</h2>
<div class="outline-text-2" id="text-orgb76364b">
<p>
This changes worryingly frequently so it may not be up to date. 
</p>
</div>
<div id="outline-container-org9fa6c29" class="outline-4">
<h4 id="org9fa6c29">OS</h4>
<div class="outline-text-4" id="text-org9fa6c29">
<p>
<a href="https://voidlinux.org/">Void Linux</a> (<a href="https://github.com/semilin/dots">dots</a>).
</p>
</div>
</div>
<div id="outline-container-orgc7d7abe" class="outline-4">
<h4 id="orgc7d7abe">Window Manager</h4>
<div class="outline-text-4" id="text-orgc7d7abe">
<p>
<a href="https://github.com/baskerville/bspwm">BSPWM</a> (<a href="https://github.com/semilin/dots/blob/main/bspwm/bspwmrc">config</a>).
</p>
</div>
</div>
<div id="outline-container-orgc31f8ea" class="outline-4">
<h4 id="orgc31f8ea">Editor</h4>
<div class="outline-text-4" id="text-orgc31f8ea">
<p>
<a href="https://www.gnu.org/software/emacs/">Emacs</a> (<a href="https://github.com/semilin/dotemacs">config</a>).
</p>
</div>
</div>
<div id="outline-container-org2fdb8ba" class="outline-4">
<h4 id="org2fdb8ba">Keyboard</h4>
<div class="outline-text-4" id="text-org2fdb8ba">
<p>
<a href="https://boardsource.xyz/store/5f2e7e4a2902de7151494f92">BoardSource Microdox</a>.
</p>
</div>
</div>
<div id="outline-container-org9a2c036" class="outline-4">
<h4 id="org9a2c036">Layout</h4>
<div class="outline-text-4" id="text-org9a2c036">
<p>
<a href="semimak/index.html#orgcf5a44e">Semimak JQ</a>, my personal mod of Semimak.
In the past, I have used (higher = more recent):
</p>
<ul class="org-ul">
<li>Semimak</li>
<li><a href="https://notgate.github.io/layout/">ISRT</a></li>
<li><a href="https://colemakmods.github.io/mod-dh/">Colemak DH</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3e1a517" class="outline-2">
<h2 id="org3e1a517">Contact Information</h2>
<div class="outline-text-2" id="text-org3e1a517">
<ul class="org-ul">
<li>Email: <a href="mailto:semilinares@pm.me">semilinares@pm.me</a></li>
<li><a href="https://matrix.org/">Matrix</a>: <code>@semilin0:matrix.org</code></li>
<li>Discord: <code>semi#5753</code></li>
<li><a href="https://getsession.org/">Session</a>: <code>05d026a337fe782d2a0ef5fe172fa5634f0291ed2bdf0d98025e11d5542ee2c613</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
